# TopProfile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SweptBlend..::..TopProfile Property
SweptBlend Class See Also
---
The curves which make up the top profile of the sketch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurveArrArray TopProfile { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TopProfile As CurveArrArray
	Get
```

Visual C++
---
```text
public:
property CurveArrArray^ TopProfile {
	CurveArrArray^ get ();
}
```

# Remarks
The indices of the curves in this array match the indices used in the vertex connection map.
# See Also
SweptBlend Class
Autodesk.Revit.DB Namespace